EDT/УТ/src/Documents/ФормированиеЭкипажей/ФормированиеЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеЭкипажей</name>
  <registerRecords>InformationRegister.СформированныеЭкипажи</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Экипажи</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Экспедитор</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СформированныеЭкипажи/СформированныеЭкипажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СформированныеЭкипажи</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ФормированиеЭкипажей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СформированныеЭкипажи
	Движения.СформированныеЭкипажи.Записывать = Истина;
	Движения.СформированныеЭкипажи.Очистить();
	
	Для Каждого ТекСтрокаЭкипажи Из Экипажи Цикл
		Движение = Движения.СформированныеЭкипажи.Добавить();
		Движение.Период = Дата;
		Движение.Регион = Регион;
		Движение.Транспорт = ТекСтрокаЭкипажи.Транспорт;
		Движение.Водитель = ТекСтрокаЭкипажи.Водитель;
		Движение.Экспедитор = ТекСтрокаЭкипажи.Экспедитор;
		Движение.Пользователь = Пользователь;
	КонецЦикла;

КонецПроцедуры
